OpenFOAM/elliot-7/Dissertation/NOTCH/channelFlow1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       57600;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       58000;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       58400;
    }
)

// ************************************************************************* //
